# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.Connection('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [2]:
cur.execute("""select firstname, lastname

                       
                      from employees
                      join offices
                      using(officecode)
                      
                      where city = "Boston"
                      
                      ;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [15]:
cur.execute("""select city,
                    count(employees.employeenumber) as empCount
                    from offices
                    left join employees
                    using(officeCode)
                    group by 1
                    having empCount = 0;""")
cur.fetchall()
# df = pd.DataFrame(cur.fetchall())
# df.columns = [x[0] for x in cur.description]
# df

# cur.execute("""select city,
#                     count(*)
#                     from offices
#                     left join employees
#                     using(officeCode)
#                     group by 1;""")
# df = pd.DataFrame(cur.fetchall())
# df.head()

[]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [27]:
# cur.execute("""select lastName, firstName,
#                       count (productName)
#                       from employees e
#                       join
#                       customers c
#                       on e.employeeNumber = c.salesRepEmployeeNumber
#                       join orders o
#                       using(customerNumber)
#                       join orderdetails od
#                       using(orderNumber)
#                       join products p
#                       using(productCode)
#                       group by 1""")

# # cur.fetchall()
# df = pd.DataFrame(cur.fetchall())
# df.columns = [x[0] for x in cur.description]
# df

cur.execute("""select firstName, lastName,
                      productName
                      from employees e
                      join
                      customers c
                      on e.employeeNumber = c.salesRepEmployeeNumber
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      join products p
                      using(productCode)""")
df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head()

2996

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [34]:
cur.execute("""select firstName, lastName,
                      count (productCode)
                      from employees e
                      join
                      customers c
                      on e.employeeNumber = c.salesRepEmployeeNumber
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      group by 1, 2 """)

# cur.fetchall()
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

#df.groupby([0,1]).count()

   firstName   lastName  count (productCode)
0       Andy     Fixter                  185
1      Barry      Jones                  220
2   Foon Yue      Tseng                  142
3     George     Vanauf                  211
4     Gerard  Hernandez                  396
5      Julie   Firrelli                  124
6      Larry       Bott                  236
7     Leslie   Jennings                  331
8     Leslie   Thompson                  114
9       Loui     Bondur                  177
10      Mami      Nishi                  137
11    Martin     Gerard                  114
12    Pamela   Castillo                  272
13     Peter      Marsh                  185
14     Steve  Patterson                  152

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!